In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Employeess(employee_id int, name varchar(20), reports_to int, age int)

In [ ]:
insert into Employeess (employee_id, name, reports_to, age) values ('9', 'Hercy', 'None', '43')

In [ ]:
insert into Employeess (employee_id, name, reports_to, age) values ('6', 'Alice', '9', '41')

In [ ]:
insert into Employeess (employee_id, name, reports_to, age) values ('4', 'Bob', '9', '36')

In [ ]:
insert into Employeess (employee_id, name, reports_to, age) values ('2', 'Winston', 'None', '37')

In [ ]:
select * from employeess

+-------------+---------+------------+-----+
| employee_id | name    | reports_to | age |
+-------------+---------+------------+-----+
| 9           | Hercy   | None       | 43  |
+-------------+---------+------------+-----+
| 6           | Alice   | 9          | 41  |
+-------------+---------+------------+-----+
| 4           | Bob     | 9          | 36  |
+-------------+---------+------------+-----+
| 2           | Winston | None       | 37  |
+-------------+---------+------------+-----+

## Write a solution to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

In [ ]:
with t as (
    select reports_to manager_id, round(avg(age)) average_age, count(*) reports_count from employeess group by reports_to
)

select * from t where manager_id

+------------+-------------+---------------+
| manager_id | average_age | reports_count |
+------------+-------------+---------------+
| 9          | 39.0        | 2             |
+------------+-------------+---------------+

In [ ]:
select * from employeess e1, employeess e2 where e1.employee_id=e2.reports_to

+-------------+-------+------------+-----+-------------+-------+------------+-----+
| employee_id | name  | reports_to | age | employee_id | name  | reports_to | age |
+-------------+-------+------------+-----+-------------+-------+------------+-----+
| 9           | Hercy | None       | 43  | 4           | Bob   | 9          | 36  |
+-------------+-------+------------+-----+-------------+-------+------------+-----+
| 9           | Hercy | None       | 43  | 6           | Alice | 9          | 41  |
+-------------+-------+------------+-----+-------------+-------+------------+-----+

In [ ]:
select count(*) from employeess e1, employeess e2 where e1.employee_id=e2.reports_to group by e1.employee_id

+----------+
| count(*) |
+----------+
| 2        |
+----------+

### manual where

In [ ]:
select e1.employee_id, e1.name, count(*), avg(e2.age) from employeess e1, employeess e2 where e1.employee_id=e2.reports_to group by e1.employee_id

+-------------+-------+----------+-------------+
| employee_id | name  | count(*) | avg(e2.age) |
+-------------+-------+----------+-------------+
| 9           | Hercy | 2        | 38.5        |
+-------------+-------+----------+-------------+

### another way : inner join

In [ ]:
select count(*) from employeess e1 inner join employeess e2 on e1.employee_id=e2.reports_to group by e1.employee_id, e1.name

+----------+
| count(*) |
+----------+
| 2        |
+----------+